research/chemhw.tex
% Created 2021-10-24 Sun 22:15
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[dvipsnames]{xcolor}
\usepackage[colorlinks=true, linkcolor=Blue, citecolor=BrickRed, urlcolor=PineGreen]{hyperref}
\usepackage{indentfirst}
\usepackage{chemfig}
\usepackage[version=4]{mhchem}
\usepackage{enumerate}

% features: (custom-font acronym .alegreya-tabular-figures underline par-sep alegreya-typeface table)
\usepackage[osf]{Alegreya}
\usepackage{AlegreyaSans}
\usepackage[scale=0.88]{sourcecodepro}

\newcommand{\acr}[1]{\protect\textls*[110]{\scshape #1}}
\newcommand{\acrs}{\protect\scalebox{.91}[.84]\hspace{0.15ex}s}

\makeatletter
% tabular lining figures in tables
\renewcommand{\tabular}{\AlegreyaTLF\let\@halignto\@empty\@tabular}
\makeatother

\usepackage[normalem]{ulem}
\setlength{\parskip}{\baselineskip}
\setlength{\parindent}{0pt}

\usepackage{longtable}
\usepackage{booktabs}
% end features
\author{Shaurya Singh}
\date{\today}
\title{Effect of common diabetic drug metformin on the aging process.\\\medskip
\large Science Research: Intro \#1}
\colorlet{greenyblue}{blue!70!green}
\colorlet{blueygreen}{blue!40!green}
\providecolor{link}{named}{greenyblue}
\providecolor{cite}{named}{blueygreen}
\hypersetup{
  pdfauthor={Shaurya Singh},
  pdftitle={Effect of common diabetic drug metformin on the aging process.},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 29.0.50 (Org mode 9.5)},
  pdflang={English},
  breaklinks=true,
  colorlinks=true,
  linkcolor=,
  urlcolor=link,
  citecolor=cite
}
\urlstyle{same}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents


\section{Proposal}
\label{sec:org3889c7e}
Diabetes is becoming one of the most widespread health burning problems in the elderly. Worldwide prevalence of diabetes among subjects over 65 years was 135.6 million in 2019, a number that is expected to double in 2045. Over 34 million Americans have diabetes, and over 88\% of diabetic Americans take oral medications and insulin to treat and control it. While these drugs suppress type 2 diabetes, previous studies have shown a link between such drugs and (de)accelerated aging. Of these drugs, metformin is the most prevalent. In this study I will utilize the zebrafish model to test the effect of metformin on the aging process in a healthy individual. Zebrafish, who have a similar genetic structure to humans, will be subjected to metformin for different times and doses. The resulting zebrafish DNA will be assessed for DNA damage, and the resulting RNA will be assessed for damage on DNA repair genes such as PARP1 (Poly[ADP-Ribose]Polymerase 1) and PCNA (Proliferating Cell Nuclear Antigen). Such research will help us further improve our understanding of the aging of the human body in the long-term.

\section{Method}
\label{sec:org4e856a0}
\begin{enumerate}
\item We are going to take 2 Drugs. Each drug will have 5 fish per time/dose
\begin{itemize}
\item No drug
\item Drug
\item Vehicle
\item postive/negative controls
\end{itemize}
\item Euthanize zebrafish (\(300mg/L\) using MS222 at PH 7.0)
\item Asses DNA damage;
\begin{itemize}
\item Isolate DNA
\item Run it on agarose gel to isolate DNA
\item Run under ethidium bromide + UV Light (+buffer to maintain enviornment)
\item Check for streaks/damage/etc with ladder
\end{itemize}
\item Asses DNA Repair Mechanisms
\begin{itemize}
\item Transcribe/Isolate RNA
\item Two step (cDNA, primer, operate on cDNA) OR One step (cDNA+primer \(\Rightarrow\) 3`/5` 5`/3`)
\item Focus on repair genes i.e. PARP1 and PCNA
\item Find Primer:
\begin{enumerate}
\item mRNA sequence \(\Rightarrow\) CDS
\item Blast
\end{enumerate}
\item PCR process to amplify Signal
\end{itemize}
\end{enumerate}

\section{Supplies/Cost}
\label{sec:org3f63f83}
Contact:
\begin{center}
\begin{tabular}{lll}
\toprule
Supply & Cost (\$) & Notes\\
\midrule
Eppendorf Tube &  & \\
EDTA &  & \\
Triton X-100 &  & \\
Proteinase K &  & \\
\(\ce{C2H6O}\) Ethanol &  & \\
Agarose gel &  & \\
Ladder + Loading Buffer &  & \\
UV Light &  & \\
Ethidium Bromide &  & \\
Micro Pipettes &  & \\
\textbf{Subtotal} & \$1000-2000 & \\
Inhibitors &  & \\
Zebrafish &  & \\
Zebrafish maintainence &  & \\
\textbf{Subtotal} &  & \\
\textbf{Total} &  & \\
\bottomrule
\end{tabular}
\end{center}
\end{document}
